public class ClientsHolder {
    private static final String[] NAMES = new String[] {
            "Иванов Иван",
            "Петров Петр",
            "Сидоров Олег",
            "Джавов Василий",
            "Краснозвездов Семен",
            "Петров Александр",
            "Алферов Роман",
            "Федоров Андрей",
            "Васильев Василий",
            "Штрафов Артем",
            "ООО Рога и Копыта",
            "НоуНеймЛТД",
            "Большой Начальник",
            "Оператор",
            "Служащий",
            "ЗАО Важная Компания",
    };

    public static String[] getNAMES() {
        return NAMES;
    }
}
